# Lesson 4 Class Exercises: Pandas Part 2

With these class exercises we learn a few new things.  When new knowledge is introduced you'll see the icon shown on the right: 
<span style="float:right; margin-left:10px; clear:both;">![Task](https://github.com/spficklin/Data-Analytics-With-Python/blob/master/media/new_knowledge.png?raw=true)</span>
## Get Started
Import the Numpy and Pandas packages

In [1]:
import numpy as np
import pandas as pd

## Exercise 1: Review of Pandas Part 1
### Task 1: Explore the data
Import the data from the [Lectures in Quantiatives Economics](https://github.com/QuantEcon/lecture-source-py) regarding minimum wages in countries round the world in US Dollars.  You can view the data [here](https://github.com/QuantEcon/lecture-source-py/blob/master/source/_static/lecture_specific/pandas_panel/realwage.csv) and you can access the data file here: https://raw.githubusercontent.com/QuantEcon/lecture-source-py/master/source/_static/lecture_specific/pandas_panel/realwage.csv.  Then perform the following

Import the data into a variable named `minwages` and print the first 5 lines of data to explore what is there.

In [5]:
minwages = pd.read_csv("https://raw.githubusercontent.com/QuantEcon/lecture-source-py/master/source/_static/lecture_specific/pandas_panel/realwage.csv")

minwages.head()

,Unnamed: 0,Time,Country,Series,Pay period,value
0,0,2006-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17132.443
1,1,2007-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18100.918
2,2,2008-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17747.406
3,3,2009-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18580.139
4,4,2010-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18755.832

Find the shape of the data.

In [6]:
minwages.shape

(1408, 6)

List the column names.

In [4]:
minwages.columns

Index(['Unnamed: 0', 'Time', 'Country', 'Series', 'Pay period', 'value'], dtype='object')

Identify the data types. Do they match what you would expect?

In [19]:
minwages.dtypes

Unnamed: 0             int64
Time          datetime64[ns]
Country               object
Series                object
Pay period            object
value                float64
dtype: object

In [17]:
minwages['Time'] = pd.to_datetime(minwages['Time'])

Identify columns with missing values.

In [18]:
minwages.isna().sum()

Unnamed: 0     0
Time           0
Country        0
Series         0
Pay period     0
value         68
dtype: int64

Identify if there are duplicated entires.

In [20]:
minwages.duplicated().sum()

0

How many unique values per row are there.  Do these look reasonable for the data type and what you know about what is stored in the column?

In [21]:
minwages.nunique()

Unnamed: 0    1408
Time            11
Country         32
Series           2
Pay period       2
value         1289
dtype: int64

In [28]:
#removing index column

minwages.head()

,Time,Country,Series,Pay period,value
0,2006-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17132.443
1,2007-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18100.918
2,2008-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17747.406
3,2009-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18580.139
4,2010-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18755.832

### Task 2: Explore More

Retrieve descriptive statistics for the data.

In [29]:
minwages.describe()

              value
count   1340.000000
mean    5697.843084
std     7475.920784
min        0.234000
25%        4.388742
50%      290.606495
75%    10501.730500
max    25713.797000

Identify all of the countries listed in the data.

In [41]:
minwages['Country'].nunique()

32

In [42]:
minwages['Country'].unique()

array(['Ireland', 'Spain', 'Australia', 'Turkey', 'Luxembourg',
       'New Zealand', 'United Kingdom', 'Mexico', 'Greece',
       'Slovak Republic', 'Portugal', 'France', 'United States', 'Japan',
       'Netherlands', 'Estonia', 'Hungary', 'Poland', 'Czech Republic',
       'Canada', 'Korea', 'Slovenia', 'Chile', 'Israel', 'Belgium',
       'Germany', 'Brazil', 'Russian Federation', 'Lithuania', 'Latvia',
       'Colombia', 'Costa Rica'], dtype=object)

Convert the time column to a datetime object.

List the time points that were used for data collection. How many years of data collection were there? What time of year were the data collected?

In [44]:
minwages['Time'].unique()

array(['2006-01-01T00:00:00.000000000', '2007-01-01T00:00:00.000000000',
       '2008-01-01T00:00:00.000000000', '2009-01-01T00:00:00.000000000',
       '2010-01-01T00:00:00.000000000', '2011-01-01T00:00:00.000000000',
       '2012-01-01T00:00:00.000000000', '2013-01-01T00:00:00.000000000',
       '2014-01-01T00:00:00.000000000', '2015-01-01T00:00:00.000000000',
       '2016-01-01T00:00:00.000000000'], dtype='datetime64[ns]')

Because we only have one data point collected per year per country, simplify this by adding a new column with just the year.  Print the first 5 rows to confirm the column was added.

In [40]:
minwages['Year'] = minwages['Time'].dt.year
minwages.head()

,Time,Country,Series,Pay period,value,Year
0,2006-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17132.443,2006
1,2007-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18100.918,2007
2,2008-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17747.406,2008
3,2009-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18580.139,2009
4,2010-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18755.832,2010

There are two pay periods.  Retrieve them in a list of just the two strings

In [45]:
minwages['Pay period'].unique()

array(['Annual', 'Hourly'], dtype=object)

### Task 3: Clean the data
We have no duplicates in this data so we do not need to consider removing those, but we do have missing values in the `value` column. Lets remove those.  Check the dimensions afterwards to make sure they rows with missing values are gone.

In [48]:
print(minwages.shape)
minwages.dropna(inplace = True)
print(minwages.shape)
minwages.isna().sum()

(1340, 6)
(1340, 6)

Time          0
Country       0
Series        0
Pay period    0
value         0
Year          0
dtype: int64

Remove the "Unnamed: 0" column as it's not needed.

In [49]:
pd.isnull(minwages).sum()

Time          0
Country       0
Series        0
Pay period    0
value         0
Year          0
dtype: int64

### Task 4:  Indexing
Use boolean indexing to retrieve the rows of annual salary in United States

In [52]:
minwages[(minwages['Country'] == "United States") & (minwages['Pay period'] == "Annual")]

,Time,Country,Series,Pay period,value,Year
528,2006-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,12594.397,2006
529,2007-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,12974.395,2007
530,2008-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,14097.556,2008
531,2009-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15756.423,2009
532,2010-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,16391.313,2010
533,2011-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15889.705,2011
534,2012-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15567.554,2012
535,2013-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15342.814,2013
536,2014-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15097.890,2014
537,2015-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15080.000,2015
538,2016-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,14892.122,2016
550,2006-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,12594.397,2006
551,2007-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,12974.395,2007
552,2008-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,14097.556,2008
553,2009-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15756.423,2009
554,2010-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,16391.313,2010
555,2011-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15889.705,2011
556,2012-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15567.554,2012
557,2013-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15342.814,2013
558,2014-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15097.890,2014
559,2015-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15080.000,2015
560,2016-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,14892.122,2016

Do we have enough data to calculate descriptive statistics for annual salary in the United States in 2016?

Use `loc` to calculate descriptive statistics for the hourly salary in the United States and then again separately for Ireland. Hint: you will have to set row indexes.  Hint: you should reset the index before using `loc`

In [53]:
minwages.index = minwages['Country']

minwages.head()

,Time,Country,Series,Pay period,value,Year
Country,,,,,,
Ireland,2006-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17132.443,2006
Ireland,2007-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18100.918,2007
Ireland,2008-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17747.406,2008
Ireland,2009-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18580.139,2009
Ireland,2010-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18755.832,2010

In [56]:
minwages[minwages["Pay period"] == "Annual"].loc["United States"].describe()

              value         Year
count     22.000000    22.000000
mean   14880.379000  2011.000000
std     1167.568383     3.236694
min    12594.397000  2006.000000
25%    14296.197500  2008.250000
50%    15097.890000  2011.000000
75%    15709.205750  2013.750000
max    16391.313000  2016.000000

Now do the same for Annual salary

## Exercise 2: Occurances
First, reset the indexes back to numeric values. Print the first 10 lines to confirm.

Get the count of how many rows there are per year?

In [58]:
minwages['Year'].value_counts()

2016    128
2015    128
2014    124
2013    120
2012    120
2011    120
2010    120
2009    120
2008    120
2007    120
2006    120
Name: Year, dtype: int64

## Exercise 3: Grouping
### Task 1: Aggregation
Calculate the average salary for each country across all years.

In [62]:
minwages = minwages.reset_index(drop = True)

In [69]:
mw_groups = minwages.groupby(['Country', 'Year', 'Pay period', 'Series'])

In [70]:
mwmean = mw_groups.mean()
mwmean.head()

                                                                                    value
Country   Year Pay period Series
Australia 2006 Annual     In 2015 constant prices at 2015 USD PPPs            20410.65200
                          In 2015 constant prices at 2015 USD exchange rates  23826.63700
               Hourly     In 2015 constant prices at 2015 USD PPPs               10.33073
                          In 2015 constant prices at 2015 USD exchange rates     12.06000
          2007 Annual     In 2015 constant prices at 2015 USD PPPs            21087.56800

Calculate the average salary and hourly wage for each country across all years. Save the resulting dataframe containing the means into a new variable named `mwmean`.

<span style="float:right; margin-left:10px; clear:both;">![Task](https://github.com/spficklin/Data-Analytics-With-Python/blob/master/media/new_knowledge.png?raw=true)</span>

Above we saw how to aggregate using built-in functions of the `DataFrameGroupBy` object. For eaxmple we called the `mean` function directly. These handly functions help with writing succint code. However, you can also use the `aggregate` function to do more! You can learn more on the [aggregate description page](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html)

With `aggregate` we can perform operations across rows and columns, and we can perform more than one operation at a time.  Explore the online documentation for the function and see how you would calculate the mean, min, and max for each country and pay period type, as well as the total number of records per country and pay period:

In [73]:
mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
mwgroup['value'].aggregate(['mean', 'max', 'min', 'count'])

                                   mean          max          min  count
Country        Pay period
Australia      Annual      22950.927364  25643.72900  20410.65200     22
               Hourly         11.616901     12.98100     10.33073     22
Belgium        Annual      21146.370318  22140.19100  20228.74200     22
               Hourly         10.138833     10.61538      9.69900     22
Brazil         Annual       3364.827682   4753.59910   2032.87300     22
...                                 ...          ...          ...    ...
Turkey         Hourly          3.432194      5.78927      2.22200     22
United Kingdom Annual      18808.980409  21352.73000  16510.78300     22
               Hourly          9.043460     10.26200      7.93763     22
United States  Annual      14880.379000  16391.31300  12594.39700     22
               Hourly          7.154966      7.88044      6.05500     22

[64 rows x 4 columns]

Also you can use the aggregate on a single column of the grouped object. For example:

```python
    mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
    mwgroup['value'].aggregate(['mean'])

```
Redo the aggregate function in the previous cell but this time apply it to a single column.

In [74]:
mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
mwgroup['value'].aggregate(['mean'])

                                   mean
Country        Pay period
Australia      Annual      22950.927364
               Hourly         11.616901
Belgium        Annual      21146.370318
               Hourly         10.138833
Brazil         Annual       3364.827682
...                                 ...
Turkey         Hourly          3.432194
United Kingdom Annual      18808.980409
               Hourly          9.043460
United States  Annual      14880.379000
               Hourly          7.154966

[64 rows x 1 columns]

### Task 2: Slicing/Indexing
<span style="float:right; margin-left:10px; clear:both;">![Task](https://github.com/spficklin/Data-Analytics-With-Python/blob/master/media/new_knowledge.png?raw=true)</span>

In the following code the resulting dataframe should contain only one data column: the mean values. It does, however, have two levels of indexes: Country and Pay period.  For example:

```python
mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
mwmean = mwgroup.mean()
mwmean
```

Try it out:

In [75]:
mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
mwmean = mwgroup.mean()
mwmean

                                  value
Country        Pay period
Australia      Annual      22950.927364
               Hourly         11.616901
Belgium        Annual      21146.370318
               Hourly         10.138833
Brazil         Annual       3364.827682
...                                 ...
Turkey         Hourly          3.432194
United Kingdom Annual      18808.980409
               Hourly          9.043460
United States  Annual      14880.379000
               Hourly          7.154966

[64 rows x 1 columns]

Notice in the output above there are two levels of indexes. This is called MultiIndexing.  In reality, there is only one data column and two index levels.  So, you can do this:

```python
mwmean['value']
```

But you can't do this:

```python
mwmean['Pay period']
```

Why not? Try it:

In [76]:
mwmean['value']

Country         Pay period
Australia       Annual        22950.927364
                Hourly           11.616901
Belgium         Annual        21146.370318
                Hourly           10.138833
Brazil          Annual         3364.827682
                                  ...
Turkey          Hourly            3.432194
United Kingdom  Annual        18808.980409
                Hourly            9.043460
United States   Annual        14880.379000
                Hourly            7.154966
Name: value, Length: 64, dtype: float64

In [77]:
mwmean['Pay period']

KeyError: 'Pay period'

The reason we cannot exeucte `mwmean['Pay period']` is because `Pay period` is not a data column. It's an index.  Let's learn how to use MultiIndexes to retrieve data. You can learn more about it on the [MultiIndex/advanced indexing page](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#advanced-indexing-with-hierarchical-index)

First, let's take a look at the indexes using the `index` attribute. 

```python
mwmean.index
```

Try it:

In [78]:
mwmean.index

MultiIndex([(         'Australia', 'Annual'),
            (         'Australia', 'Hourly'),
            (           'Belgium', 'Annual'),
            (           'Belgium', 'Hourly'),
            (            'Brazil', 'Annual'),
            (            'Brazil', 'Hourly'),
            (            'Canada', 'Annual'),
            (            'Canada', 'Hourly'),
            (             'Chile', 'Annual'),
            (             'Chile', 'Hourly'),
            (          'Colombia', 'Annual'),
            (          'Colombia', 'Hourly'),
            (        'Costa Rica', 'Annual'),
            (        'Costa Rica', 'Hourly'),
            (    'Czech Republic', 'Annual'),
            (    'Czech Republic', 'Hourly'),
            (           'Estonia', 'Annual'),
            (           'Estonia', 'Hourly'),
            (            'France', 'Annual'),
            (            'France', 'Hourly'),
            (           'Germany', 'Annual'),
            (           'Germany', 'Hourly'),
            (            'Greece', 'Annual'),
            (            'Greece', 'Hourly'),
            (           'Hungary', 'Annual'),
            (           'Hungary', 'Hourly'),
            (           'Ireland', 'Annual'),
            (           'Ireland', 'Hourly'),
            (            'Israel', 'Annual'),
            (            'Israel', 'Hourly'),
            (             'Japan', 'Annual'),
            (             'Japan', 'Hourly'),
            (             'Korea', 'Annual'),
            (             'Korea', 'Hourly'),
            (            'Latvia', 'Annual'),
            (            'Latvia', 'Hourly'),
            (         'Lithuania', 'Annual'),
            (         'Lithuania', 'Hourly'),
            (        'Luxembourg', 'Annual'),
            (        'Luxembourg', 'Hourly'),
            (            'Mexico', 'Annual'),
            (            'Mexico', 'Hourly'),
            (       'Netherlands', 'Annual'),
            (       'Netherlands', 'Hourly'),
            (       'New Zealand', 'Annual'),
            (       'New Zealand', 'Hourly'),
            (            'Poland', 'Annual'),
            (            'Poland', 'Hourly'),
            (          'Portugal', 'Annual'),
            (          'Portugal', 'Hourly'),
            ('Russian Federation', 'Annual'),
            ('Russian Federation', 'Hourly'),
            (   'Slovak Republic', 'Annual'),
            (   'Slovak Republic', 'Hourly'),
            (          'Slovenia', 'Annual'),
            (          'Slovenia', 'Hourly'),
            (             'Spain', 'Annual'),
            (             'Spain', 'Hourly'),
            (            'Turkey', 'Annual'),
            (            'Turkey', 'Hourly'),
            (    'United Kingdom', 'Annual'),
            (    'United Kingdom', 'Hourly'),
            (     'United States', 'Annual'),
            (     'United States', 'Hourly')],
           names=['Country', 'Pay period'])

Notice that each index is actually a tuple with two levels. The first is the country names and the second is the pay period. Remember, we can use the `loc` function, to slice a dataframe using indexes.  We can do so with a MultiIndexed dataframe as well. For example, to extract all elements with they index named 'Australia':

```python
mwmean.loc[('Australia')]
```

Try it yourself:

In [79]:
mwmean.loc[("Australia")]

                   value
Pay period
Annual      22950.927364
Hourly         11.616901

You can specify both indexes to pull out a single row. For example, to find the average hourly salary in Australia:

```python
mwmean.loc[('Australia','Hourly')]
```
Try it yourself:

In [80]:
mwmean.loc[('Australia', 'Hourly')]

value    11.616901
Name: (Australia, Hourly), dtype: float64

Suppose you wanted to retrieve all of the mean "Hourly" wages. For MultiIndexes, there are multiple ways to slice it, some are not entirely intuitive or flexible enough.  Perhaps the easiest is to use the `pd.IndexSlice` object.  It allows you to specify an index format that is intuitive to the way you've already learned to slice.  For example:

```python
idx = pd.IndexSlice
mwmean.loc[idx[:,'Hourly'],:]
```

In the code above the `idx[:, 'Hourly']` portion is used in the "row" indexor position of the `loc` function. It indicates that we want all possible first-level indexes (specified with the `:`) and we want second-level indexes to be restricted to "Hourly".  
Try it out yourself:

In [81]:
idx = pd.IndexSlice
mwmean.loc[idx[:,'Hourly'],:]

                                   value
Country            Pay period
Australia          Hourly      11.616901
Belgium            Hourly      10.138833
Brazil             Hourly       1.438636
Canada             Hourly       7.632323
Chile              Hourly       2.073636
Colombia           Hourly       1.675000
Costa Rica         Hourly       3.050000
Czech Republic     Hourly       2.962613
Estonia            Hourly       2.600362
France             Hourly      10.670190
Germany            Hourly       9.842050
Greece             Hourly       4.706923
Hungary            Hourly       2.787416
Ireland            Hourly       9.202719
Israel             Hourly       5.620840
Japan              Hourly       6.504039
Korea              Hourly       4.415651
Latvia             Hourly       2.331371
Lithuania          Hourly       2.422192
Luxembourg         Hourly      11.407892
Mexico             Hourly       0.699421
Netherlands        Hourly       9.703129
New Zealand        Hourly       9.004981
Poland             Hourly       3.387693
Portugal           Hourly       3.617441
Russian Federation Hourly       0.905700
Slovak Republic    Hourly       2.553655
Slovenia           Hourly       5.473895
Spain              Hourly       4.589141
Turkey             Hourly       3.432194
United Kingdom     Hourly       9.043460
United States      Hourly       7.154966

Using what you've learned above about slicing the MultiIndexed dataframe, find out which country has had the highest average annual salary.

In [86]:
maxsal = mwmean.loc[idx[:,'Annual'],:].max().sum()

mwmean[mwmean['value'] ==maxsal]

                              value
Country    Pay period
Luxembourg Annual      23680.787909

You can move the indexes into the dataframe and reset the index to a traditional single-level numeric index by reseting the indexes:    
```python
mwmean.reset_index()
```

Try it yourself:

### Task 3: Filtering the original data.
<span style="float:right; margin-left:10px; clear:both;">![Task](https://github.com/spficklin/Data-Analytics-With-Python/blob/master/media/new_knowledge.png?raw=true)</span>

Another way we might want to filter is to find records in the dataset that, after grouping meets some criteria. For example, what if we wanted to find the records for all countries with the average annual salary was greater than $35K?

To do this, we can use the `filter` function of the `DataFrameGroupBy` object. The filter function must take a function as an argument (this is new and may seem weird).  

```python
annualwages = minwages[minwages['Pay period'] == 'Annual']
annualwages.groupby(['Country']).filter(
    lambda x : x['value'].mean() > 22000
)
```
Try it:

### Task 4: Reset the index
If you do not want to use MultiIndexes and you prefer to return any Multiindex dataset back to a traditional 1-level index dataframe you can use the`reset_index` function. 

Try it out on the `mwmean` dataframe:

## Exercise 4:  Task 6d from the practice notebook
Load the iris dataset. 

In the Iris dataset:
+ Create a new column with the label "region" in the iris data frame. This column will indicates geographic regions of the US where measurments were taken. Values should include:  'Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'. Use these randomly.
+ Use `groupby` to get a new data frame of means for each species in each region.
+ Add a `dev_stage` column by randomly selecting from the values "early" and "late".
+ Use `groupby` to get a new data frame of means for each species, in each region and each development stage.
+ Use the `count` function (just like you used the `mean` function) to identify how many rows in the table belong to each combination of species + region + developmental stage.

## Exercise 5: Kaggle Titanic Dataset
A dataset of Titanic passengers and their fates is provided by the online machine learning competition server [Kaggle](https://www.kaggle.com/). See the [Titanic project](https://www.kaggle.com/c/titanic) page for more details. 

Let's practice all we have learned thus far to explore and perhaps clean this dataset.  You have been provided with the dataset named `Titanic_train.csv`.  

### Task 1: Explore the data
First import the data and print the first 10 lines.

Find the shape of the data.

List the column names.

Identify the data types. Do they match what you would expect?

Identify columns with missing values.

Identify if there are duplicated entires.

How many unique values per row are there.  Do these look reasonable for the data type and what you know about what is stored in the column?

### Task 2: Clean the data
Do missing values need to be removed? If so, remove them.

Do duplicates need to be removed?  If so remove them.

### Task 3: Find Interesting Facts
Count the number of passengers that survied and died in each passenger class

Were men or women more likely to survive?

What was the average, min and max ticket prices per passenger class?
Hint:  look at the help page for the [agg](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html) function to help simplify this.

Give descriptive statistics about the survival age.